cask_args appdir: "/Applications"

tap "homebrew/bundle"
tap "homebrew/services"

brew "tmux"
brew "fish"
brew "git"
brew "git-lfs"
brew "git-open"
brew "git-extras"
brew "git-secrets"
brew "hub"
brew "diff-so-fancy"
brew "automake"
brew "autoconf"
brew "make"
brew "openssl"
brew "gdbm"
brew "readline"
brew "gmp"
brew "nkf"
brew "binutils"
brew "coreutils"
brew "findutils"
brew "libtool"
brew "gnu-sed"
brew "gnu-tar"
brew "grep"
brew "gzip"
brew "p7zip"
cask "rar"
brew "gawk"
brew "bison"
brew "rsync"
brew "wget"
brew "shared-mime-info"
brew "pkg-config"
cask "codeql"
brew "gnupg"
brew "pinentry-mac"
brew "python"
cask "anaconda"
brew "pipenv"
brew "poetry"
brew "deno"
brew "just"
brew "elixir"
brew "cmake"
brew "ninja"
brew "mold"
brew "maven"
cask "oracle-jdk"
brew "bazel"
brew "llvm"
brew "clang-format"
brew "direnv"
brew "parallel"
brew "jq"
brew "xmlstarlet"
brew "ffmpeg" # for ripgrep_all
brew "ttyd"
brew "pandoc" # for ripgrep_all
brew "poppler" # for ripgrep_all
brew "tesseract" # for ripgrep_all
brew "codespell"
brew "zopfli"
brew "jpegoptim"
brew "dog"
brew "aspell"
brew "circleci"
brew "m-cli"
brew "hyperfine"
brew "watchman"
brew "s3cmd"
brew "xdelta"
brew "fdupes"
brew "postgresql@17"
brew "valkey"
tap "elastic/tap"
brew "elastic/tap/elasticsearch-full"
brew "imagemagick"
brew "consul-template"
brew "graphviz"
brew "vips"
brew "re2"
brew "yajl"
brew "gpgme"
brew "libidn"
brew "icu4c"
brew "protobuf"
brew "ragel"
brew "guetzli"
brew "lcov"
brew "opentofu"
brew "ansible"
brew "sshuttle"
brew "snapcraft"
brew "docker"
brew "podman"
brew "podman-compose"
brew "skopeo"
brew "kind"
brew "kubectl"
brew "helm"
brew "krew"
brew "kompose"
brew "azure-cli"
brew "gh"
brew "flyctl"
cask "abyssoft-teleport"
tap "deskflow/tap"
cask "deskflow"
cask "ghostty"
cask "alacritty"
brew "starship"
cask "discord"
cask "1password-cli"
cask "raycast"
cask "zoom"
cask "microsoft-teams"
cask "messenger"
cask "obsidian"
cask "vlc"
cask "font-mona-sans"
cask "font-hackgen"
cask "font-hackgen-nerd"
cask "visual-studio-code@insiders"
cask "microsoft-edge@beta"
cask "google-chrome"
cask "1password@beta"

tap "heroku/brew"
brew "heroku"

tap "aws/tap"
brew "aws-sam-cli"
brew "copilot-cli"

tap "buildpacks/tap"
brew "pack"

tap "rbenv/tap"
brew "openssl@1.0"

brew "mas"
mas "Windows App", id: 1295203466
mas "Slack", id: 803453959
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "1Password for Safari", id: 1569813296
mas "Amazon Kindle", id: 302584613
