cask_args appdir: "/Applications"

brew "tmux"
brew "fish"
brew "fzf"
brew "git"
brew "git-lfs"
brew "git-open"
brew "git-extras"
brew "git-secrets"
brew "git-delta"
brew "gnupg"
brew "pinentry-mac"
brew "hub"
brew "diff-so-fancy"
brew "ghq"
brew "lsd"
brew "bat"
brew "nkf"
brew "ripgrep"
brew "rga"
brew "ffmpeg" # for rga
brew "pandoc" # for rga
brew "poppler" # for rga
brew "tesseract" # for rga
brew "fd"
brew "fx"
brew "jq"
brew "gron"
brew "yq"
brew "zoxide"
brew "tealdeer"
brew "direnv"
brew "hexyl"
brew "procs"
brew "sd"
brew "dog"
brew "grex"
brew "codespell"
brew "zopfli"
brew "jpegoptim"

brew "automake"
brew "autoconf"
brew "make"
brew "openssl"
brew "gdbm"
brew "readline"
brew "gmp"
brew "coreutils"
brew "findutils"
brew "libtool"
brew "gnu-sed"
brew "gnu-tar"
brew "grep"
brew "gzip"
brew "gawk"
brew "bison"
brew "rsync"
brew "wget"
brew "consul-template"
brew "shared-mime-info"

brew "go"
brew "node"
brew "deno"
brew "rust"
brew "elixir"
cask "cmake"
brew "ninja"
brew "mold"
brew "maven"
tap "homebrew/cask-versions"
cask "adoptopenjdk8"
brew "bazel"
brew "clang-format"
brew "aspell"
brew "circleci"
brew "m-cli"
brew "s3cmd"
brew "xdelta"
brew "terraform"
cask "rar"
brew "llvm"
brew "postgresql@14"
brew "mysql"
brew "pkg-config"
brew "imagemagick"

brew "graphviz"
brew "vips"
brew "re2"
brew "yajl"
brew "gpgme"
brew "libidn"
brew "icu4c"
brew "protobuf"
brew "ragel"
brew "parallel"
brew "php"
brew "composer"
brew "guetzli"
brew "lcov"
brew "ansible"
brew "mackup"
brew "sshuttle"

brew "snapcraft"
cask "rancher"
brew "kubectl"
brew "helm"
brew "krew"
brew "kompose"
tap "mutagen-io/mutagen"
brew "mutagen"

tap "homebrew/cask"
cask "google-cloud-sdk"
brew "azure-cli"
tap "github/gh"
brew "gh"
tap "heroku/brew"
brew "heroku"
brew "flyctl"
brew "python@3.9"
brew "pipenv"
brew "poetry"
brew "openstackclient"
brew "awscli"
tap "aws/tap"
brew "aws-sam-cli"
brew "copilot-cli"
tap "buildpacks/tap"
brew "pack"

tap "homebrew/cask-fonts"
cask "font-ricty-diminished"
cask "font-hack-nerd-font"
tap "iandol/adobe-fonts"
cask "font-source-han-code-jp"

cask "alacritty"
cask "visual-studio-code-insiders"
cask "google-chrome-beta"
cask "discord"
cask "1password-beta"
cask "1password-cli"
cask "clipy"
cask "krisp"
cask "zoom"
cask "messenger"
cask "obsidian"
cask "vlc"

brew "mas"
mas "Microsoft Remote Desktop", id: 1295203466
mas "Pixelmator Classic", id: 407963104
mas "Slack", id: 803453959
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "1Password for Safari", id: 1569813296
mas "Microsoft Powerpoint", id: 462062816
mas "Microsoft Excel", id: 462058435
mas "Microsoft Word", id: 462054704
