tap "homebrew/core"
tap "homebrew/bundle"
tap "homebrew/services"
tap "homebrew/cask"

cask_args appdir: "/Applications"

brew "tmux"
brew "fish"
brew "git"
brew "git-lfs"
brew "git-open"
brew "git-extras"
brew "git-secrets"
brew "hub"
brew "diff-so-fancy"
brew "automake"
brew "autoconf"
brew "make"
brew "openssl"
brew "gdbm"
brew "readline"
brew "gmp"
brew "nkf"
brew "binutils"
brew "coreutils"
brew "findutils"
brew "libtool"
brew "gnu-sed"
brew "gnu-tar"
brew "grep"
brew "gzip"
brew "p7zip"
cask "rar"
brew "gawk"
brew "bison"
brew "rsync"
brew "wget"
brew "shared-mime-info"
brew "pkg-config"
brew "gnupg"
brew "pinentry-mac"

brew "python"
cask "anaconda"
brew "pipenv"
brew "poetry"
brew "go"
brew "node"
brew "deno"
brew "rust"
brew "just"
brew "rustfmt"
brew "elixir"
cask "cmake"
brew "ninja"
brew "mold"
brew "maven"
cask "adoptopenjdk"
brew "bazel"
brew "llvm"
brew "clang-format"

brew "direnv"
brew "parallel"
brew "jq"
brew "ffmpeg" # for ripgrep_all
brew "pandoc" # for ripgrep_all
brew "poppler" # for ripgrep_all
brew "tesseract" # for ripgrep_all
brew "codespell"
brew "zopfli"
brew "jpegoptim"
brew "dog"
brew "aspell"
brew "circleci"
brew "m-cli"
brew "s3cmd"
brew "xdelta"
brew "fdupes"
brew "postgresql@14"
brew "mysql"
brew "imagemagick"
brew "consul-template"
brew "graphviz"
brew "vips"
brew "re2"
brew "yajl"
brew "gpgme"
brew "libidn"
brew "icu4c"
brew "protobuf"
brew "ragel"
brew "guetzli"
brew "lcov"
brew "ansible"
brew "sshuttle"
brew "overmind"
brew "snapcraft"
brew "podman"
brew "podman-compose"
brew "skopeo"
brew "minikube"
brew "kubectl"
brew "helm"
brew "krew"
brew "kompose"

cask "google-cloud-sdk"
brew "azure-cli"
brew "gh"
tap "heroku/brew"
brew "heroku"
brew "flyctl"
brew "awscli"
tap "aws/tap"
brew "aws-sam-cli"
brew "copilot-cli"
tap "buildpacks/tap"
brew "pack"

tap "homebrew/cask-fonts"
cask "font-mona-sans"
cask "font-hackgen"
cask "font-hackgen-nerd"

tap "homebrew/cask-versions"
cask "visual-studio-code-insiders"
cask "google-chrome-beta"
cask "1password-beta"
cask "abyssoft-teleport"
cask "alacritty"
cask "discord"
cask "1password-cli"
cask "clipy"
cask "krisp"
cask "zoom"
cask "messenger"
cask "obsidian"
cask "vlc"
cask "kindle"
cask "vpn-by-google-one"

brew "mas"
mas "Microsoft Remote Desktop", id: 1295203466
mas "Slack", id: 803453959
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "1Password for Safari", id: 1569813296
mas "Microsoft Powerpoint", id: 462062816
mas "Microsoft Excel", id: 462058435
mas "Microsoft Word", id: 462054704
