cask_args appdir: "/Applications"

brew "tmux"
brew "fish"
brew "fzf"
brew "git"
brew "git-lfs"
brew "gnupg"
brew "hub"
brew "diff-so-fancy"
brew "ghq"
brew "lsd"
brew "bat"
brew "ripgrep"
brew "fd"
brew "fx"
brew "direnv"

brew "automake"
brew "autoconf"
brew "openssl"
brew "gdbm"
brew "readline"
brew "coreutils"
brew "findutils"
brew "libtool"
brew "gnu-sed"
brew "gnu-tar"
brew "grep"
brew "gzip"
brew "gawk"
brew "bison"
brew "rsync"
brew "wget"

brew "go"
brew "cmake"
brew "ninja"
brew "maven"
tap "homebrew/cask-versions"
cask "adoptopenjdk8"
brew "bazel"
brew "clang-format"
brew "aspell"
brew "circleci"
brew "m-cli"
brew "s3cmd"
brew "xdelta"
brew "terraform"
brew "unrar"
brew "llvm"
brew "llvm@4"
brew "postgresql"
brew "mysql"
brew "pkg-config"
brew "imagemagick"
brew "imagemagick@6"
brew "vips"
brew "re2"
brew "libidn"
brew "icu4c"
brew "protobuf"
brew "ragel"
brew "parallel"
brew "kubernetes-helm"
brew "php"
brew "composer"
brew "guetzli"
brew "lcov"
brew "ansible"
brew "mackup"
brew "mas"

tap "homebrew/cask"
cask "google-cloud-sdk"

brew "snapcraft"
cask "multipass"
cask "alacritty"

tap "heroku/brew"
brew "heroku"

brew "awscli"
tap "aws/tap"
brew "aws-sam-cli"

tap "fujiwara/tap"
brew "aswrap"

tap "buildpack/tap"
brew "pack"

tap "shopify/shopify"
brew "toxiproxy"

tap "homebrew/cask-fonts"
cask "font-ricty-diminished"
cask "font-hack-nerd-font"
cask "font-source-han-code-jp"

mas "1295203466" # Microsoft Remote Desktop (10.2.13)
mas "409203825"  # Numbers (6.1)
mas "1333542190" # 1Password 7 (7.3.1)
mas "549083868"  # Display Menu (2.2.3)
mas "409201541"  # Pages (8.1)
mas "409183694"  # Keynote (9.1)
mas "462062816"  # Microsoft PowerPoint (16.27)
mas "462054704"  # Microsoft Word (16.27)
mas "803453959"  # Slack (4.0.0)
mas "462058435"  # Microsoft Excel (16.27)
