barnybug/docker-fish-completion
jethrokuan/fzf
decors/fish-ghq
evanlucas/fish-kubectl-completions
daenney/pyenv
daenney/rbenv
jethrokuan/z
cafedomancer/fish-nodenv
