tap 'Homebrew/science'
tap 'Homebrew/dupes'

# dev env
brew 'tmux'
brew 'coreutils'
brew 'findutils'
brew 'gnu-sed'
brew 'gnu-tar'
brew 'gawk'
brew 'pstree'
brew 'aria2'
brew 'peco'
brew 'ghq'
brew 'hub'
brew 'git'
brew 'git-lfs'
brew 'git-extras'
brew 'git-secrets'
brew 'gnupg2'
brew 'maven'
brew 'cmake'
brew 'jq'

# language
brew 'node'
brew 'yarn'
brew 'perl'
brew 'go'
brew 'glide'
brew 'rust'
brew 'elixir'
brew 'crystal-lang'
brew 'r'

# dev for application
brew 'imagemagick@6'
brew 'groonga'
brew 'mysql'
brew 'redis'

# for ruby
brew 'autoconf'
brew 'openssl'
brew 'readline'
brew 'gmp'
brew 'gdbm'

# for php
brew 'mcrypt'
brew 'libxml2'
