tap 'Homebrew/science'

brew 'openssl'
brew 'readline'
brew 'gmp'
brew 'autoconf'
brew 'imagemagick'

brew 'tmux'
brew 'coreutils'
brew 'findutils'
brew 'gnu-sed'
brew 'gnu-tar'
brew 'gawk'
brew 'pstree'
brew 'aria2'
brew 'cmake'
brew 'peco'
brew 'hub'

brew 'git'
brew 'git-extras'
brew 'gnupg2'

brew 'node'
brew 'yarn'
brew 'perl'
brew 'go'
brew 'rust'
brew 'elixir'
brew 'crystal-lang'
brew 'r'

brew 'groonga'
brew 'mysql'
